
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 5 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.cft_jenkins_access
* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.cft_jenkins_access will be created
  + resource "azurerm_key_vault_access_policy" "cft_jenkins_access" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-prod"
      + object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + secret_permissions      = [
          + "Get",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - hmi-rota-dtu-prod" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - hmi-rota-dtu-prod" -> "Application-Insights-daily-cap-reached-hmi-rota-dtu-prod" # forces replacement
        tags                = {
            "application"         = "hearings-management-interface"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "production"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health (known after apply)

          ~ service_health (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rl-schedule"
      ~ start_time              = "2025-07-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rl-schedule-single-trigger"
      ~ start_time              = "2025-07-29T15:04:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rlw-schedule"
      ~ start_time              = "2025-07-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2025-07-29T15:04:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Storage/storageAccounts/hmisaprod"
        name                               = "hmisaprod"
        tags                               = {
            "application"         = "hearings-management-interface"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "production"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 5 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":94,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->